# AssocpropNeedJog Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..AssocpropNeedJog Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Need to add jog in order to satisfy constraints
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AssocpropNeedJog { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssocpropNeedJog As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AssocpropNeedJog {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace